def what_is_my_sign(day, month):
    signs = {(3, 21, 4, 20): 'Овен',
             (4, 21, 5, 20): 'Телец',
             (5, 21, 6, 20): 'Близнаци',
             (6, 21, 7, 21): 'Рак',
             (7, 22, 8, 22): 'Лъв',
             (8, 23, 9, 22): 'Дева',
             (9, 23, 10, 22): 'Везни',
             (10, 23, 11, 21): 'Скорпион',
             (11, 22, 12, 21): 'Стрелец',
             (12, 22, 1, 19): 'Козирог',
             (1, 20, 2, 18): 'Водолей',
             (2, 19, 3, 20): 'Риби'}
    for key in signs:
        if (month == key[0] and day >= key[1]) or (month == key[2] and day <= key[3]):
            return signs[key]