SINGS = {
    # ((start_month, start_day), (end_month, end_day)) : sign_name
    ((3, 21), (4, 20)): 'Овен',
    ((4, 21), (5, 20)): 'Телец',
    ((5, 21), (6, 20)): 'Близнаци',
    ((6, 21), (7, 21)): 'Рак',
    ((7, 22), (8, 22)): 'Лъв',
    ((8, 23), (9, 22)): 'Дева',
    ((9, 23), (10, 22)): 'Везни',
    ((10, 23), (11, 21)): 'Скорпион',
    ((11, 22), (12, 21)): 'Стрелец',
    ((12, 22), (31, 12)): 'Козирог',
    ((1, 1), (1, 19)): 'Козирог',
    ((1, 20), (2, 18)): 'Водолей',
    ((2, 19), (3, 20)): 'Риби'
}


def what_is_my_sign(day, month):
    for (start_date, end_date), sign_name in SINGS.items():
        if start_date <= (month, day) <= end_date:
            return sign_name
